meme_dict = {"КРИНЖ": "Что-то очень странное или стыдное",
            "РОФЛ": "Шутка",
             "СИГМА": "Очень хороший человек",
             "ЛОЛ": "Что-то очень смешное",
             "ЩИЩ": "Одобрение/восторг",
             "АГРИТСЯ": "Злиться",
             "СКУФ": "Ленивый человек"
            }



print('Здравствуйте, вы не знаете новые обозначения? Мы вам поможем')

word = input("Введите непонятное слово (большими буквами!): ")

if word in meme_dict.keys():
    print(meme_dict[word])
else:
    print('Такого слова нету')
